ARMmbed/mbed-os/targets/TARGET_Maxim/TARGET_MAX32670/Libraries/PeriphDrivers/Source/TMR/tmr_revb_regs.h
/**
 * @file    tmr_revb_regs.h
 * @brief   Registers, Bit Masks and Bit Positions for the TMR_REVB Peripheral Module.
 */

/******************************************************************************
 * Copyright (C) 2023 Maxim Integrated Products, Inc., All Rights Reserved.
 *
 * Permission is hereby granted, free of charge, to any person obtaining a
 * copy of this software and associated documentation files (the "Software"),
 * to deal in the Software without restriction, including without limitation
 * the rights to use, copy, modify, merge, publish, distribute, sublicense,
 * and/or sell copies of the Software, and to permit persons to whom the
 * Software is furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included
 * in all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS
 * OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
 * MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.
 * IN NO EVENT SHALL MAXIM INTEGRATED BE LIABLE FOR ANY CLAIM, DAMAGES
 * OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE,
 * ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR
 * OTHER DEALINGS IN THE SOFTWARE.
 *
 * Except as contained in this notice, the name of Maxim Integrated
 * Products, Inc. shall not be used except as stated in the Maxim Integrated
 * Products, Inc. Branding Policy.
 *
 * The mere transfer of this software does not imply any licenses
 * of trade secrets, proprietary technology, copyrights, patents,
 * trademarks, maskwork rights, or any other form of intellectual
 * property whatsoever. Maxim Integrated Products, Inc. retains all
 * ownership rights.
 *
 ******************************************************************************/

#ifndef _TMR_REVB_REGS_H_
#define _TMR_REVB_REGS_H_

/* **** Includes **** */
#include <stdint.h>

#ifdef __cplusplus
extern "C" {
#endif
 
#if defined (__ICCARM__)
  #pragma system_include
#endif
 
#if defined (__CC_ARM)
  #pragma anon_unions
#endif
/// @cond
/*
    If types are not defined elsewhere (CMSIS) define them here
*/
#ifndef __IO
#define __IO volatile
#endif
#ifndef __I
#define __I  volatile const
#endif
#ifndef __O
#define __O  volatile
#endif
#ifndef __R
#define __R  volatile const
#endif
/// @endcond

/* **** Definitions **** */

/**
 * @ingroup     tmr_revb
 * @defgroup    tmr_revb_registers TMR_REVB_Registers
 * @brief       Registers, Bit Masks and Bit Positions for the TMR_REVB Peripheral Module.
 * @details Low-Power Configurable Timer
 */

/**
 * @ingroup tmr_revb_registers
 * Structure type to access the TMR_REVB Registers.
 */
typedef struct {
    __IO uint32_t cnt;                  /**< <tt>\b 0x00:</tt> TMR_REVB CNT Register */
    __IO uint32_t cmp;                  /**< <tt>\b 0x04:</tt> TMR_REVB CMP Register */
    __IO uint32_t pwm;                  /**< <tt>\b 0x08:</tt> TMR_REVB PWM Register */
    __IO uint32_t intfl;                /**< <tt>\b 0x0C:</tt> TMR_REVB INTFL Register */
    __IO uint32_t ctrl0;                /**< <tt>\b 0x10:</tt> TMR_REVB CTRL0 Register */
    __IO uint32_t nolcmp;               /**< <tt>\b 0x14:</tt> TMR_REVB NOLCMP Register */
    __IO uint32_t ctrl1;                /**< <tt>\b 0x18:</tt> TMR_REVB CTRL1 Register */
    __IO uint32_t wkfl;                 /**< <tt>\b 0x1C:</tt> TMR_REVB WKFL Register */
} mxc_tmr_revb_regs_t;

/* Register offsets for module TMR_REVB */
/**
 * @ingroup    tmr_revb_registers
 * @defgroup   TMR_REVB_Register_Offsets Register Offsets
 * @brief      TMR_REVB Peripheral Register Offsets from the TMR_REVB Base Peripheral Address. 
 * @{
 */
 #define MXC_R_TMR_REVB_CNT                 ((uint32_t)0x00000000UL) /**< Offset from TMR_REVB Base Address: <tt> 0x0000</tt> */ 
 #define MXC_R_TMR_REVB_CMP                 ((uint32_t)0x00000004UL) /**< Offset from TMR_REVB Base Address: <tt> 0x0004</tt> */ 
 #define MXC_R_TMR_REVB_PWM                 ((uint32_t)0x00000008UL) /**< Offset from TMR_REVB Base Address: <tt> 0x0008</tt> */ 
 #define MXC_R_TMR_REVB_INTFL               ((uint32_t)0x0000000CUL) /**< Offset from TMR_REVB Base Address: <tt> 0x000C</tt> */ 
 #define MXC_R_TMR_REVB_CTRL0               ((uint32_t)0x00000010UL) /**< Offset from TMR_REVB Base Address: <tt> 0x0010</tt> */ 
 #define MXC_R_TMR_REVB_NOLCMP              ((uint32_t)0x00000014UL) /**< Offset from TMR_REVB Base Address: <tt> 0x0014</tt> */ 
 #define MXC_R_TMR_REVB_CTRL1               ((uint32_t)0x00000018UL) /**< Offset from TMR_REVB Base Address: <tt> 0x0018</tt> */ 
 #define MXC_R_TMR_REVB_WKFL                ((uint32_t)0x0000001CUL) /**< Offset from TMR_REVB Base Address: <tt> 0x001C</tt> */ 
/**@} end of group tmr_revb_registers */

/**
 * @ingroup  tmr_revb_registers
 * @defgroup TMR_REVB_CNT TMR_REVB_CNT
 * @brief    Timer Counter Register.
 * @{
 */
 #define MXC_F_TMR_REVB_CNT_COUNT_POS                   0 /**< CNT_COUNT Position */
 #define MXC_F_TMR_REVB_CNT_COUNT                       ((uint32_t)(0xFFFFFFFFUL << MXC_F_TMR_REVB_CNT_COUNT_POS)) /**< CNT_COUNT Mask */

/**@} end of group TMR_REVB_CNT_Register */

/**
 * @ingroup  tmr_revb_registers
 * @defgroup TMR_REVB_CMP TMR_REVB_CMP
 * @brief    Timer Compare Register.
 * @{
 */
 #define MXC_F_TMR_REVB_CMP_COMPARE_POS                 0 /**< CMP_COMPARE Position */
 #define MXC_F_TMR_REVB_CMP_COMPARE                     ((uint32_t)(0xFFFFFFFFUL << MXC_F_TMR_REVB_CMP_COMPARE_POS)) /**< CMP_COMPARE Mask */

/**@} end of group TMR_REVB_CMP_Register */

/**
 * @ingroup  tmr_revb_registers
 * @defgroup TMR_REVB_PWM TMR_REVB_PWM
 * @brief    Timer PWM Register.
 * @{
 */
 #define MXC_F_TMR_REVB_PWM_PWM_POS                     0 /**< PWM_PWM Position */
 #define MXC_F_TMR_REVB_PWM_PWM                         ((uint32_t)(0xFFFFFFFFUL << MXC_F_TMR_REVB_PWM_PWM_POS)) /**< PWM_PWM Mask */

/**@} end of group TMR_REVB_PWM_Register */

/**
 * @ingroup  tmr_revb_registers
 * @defgroup TMR_REVB_INTFL TMR_REVB_INTFL
 * @brief    Timer Interrupt Status Register.
 * @{
 */
 #define MXC_F_TMR_REVB_INTFL_IRQ_A_POS                 0 /**< INTFL_IRQ_A Position */
 #define MXC_F_TMR_REVB_INTFL_IRQ_A                     ((uint32_t)(0x1UL << MXC_F_TMR_REVB_INTFL_IRQ_A_POS)) /**< INTFL_IRQ_A Mask */

 #define MXC_F_TMR_REVB_INTFL_WRDONE_A_POS              8 /**< INTFL_WRDONE_A Position */
 #define MXC_F_TMR_REVB_INTFL_WRDONE_A                  ((uint32_t)(0x1UL << MXC_F_TMR_REVB_INTFL_WRDONE_A_POS)) /**< INTFL_WRDONE_A Mask */

