ARMmbed/mbed-os/targets/TARGET_Maxim/TARGET_MAX32670/Libraries/PeriphDrivers/Source/TMR/tmr_revb_regs.h
 #define MXC_F_TMR_REVB_INTFL_WR_DIS_A_POS              9 /**< INTFL_WR_DIS_A Position */
 #define MXC_F_TMR_REVB_INTFL_WR_DIS_A                  ((uint32_t)(0x1UL << MXC_F_TMR_REVB_INTFL_WR_DIS_A_POS)) /**< INTFL_WR_DIS_A Mask */

 #define MXC_F_TMR_REVB_INTFL_IRQ_B_POS                 16 /**< INTFL_IRQ_B Position */
 #define MXC_F_TMR_REVB_INTFL_IRQ_B                     ((uint32_t)(0x1UL << MXC_F_TMR_REVB_INTFL_IRQ_B_POS)) /**< INTFL_IRQ_B Mask */

 #define MXC_F_TMR_REVB_INTFL_WRDONE_B_POS              24 /**< INTFL_WRDONE_B Position */
 #define MXC_F_TMR_REVB_INTFL_WRDONE_B                  ((uint32_t)(0x1UL << MXC_F_TMR_REVB_INTFL_WRDONE_B_POS)) /**< INTFL_WRDONE_B Mask */

 #define MXC_F_TMR_REVB_INTFL_WR_DIS_B_POS              25 /**< INTFL_WR_DIS_B Position */
 #define MXC_F_TMR_REVB_INTFL_WR_DIS_B                  ((uint32_t)(0x1UL << MXC_F_TMR_REVB_INTFL_WR_DIS_B_POS)) /**< INTFL_WR_DIS_B Mask */

/**@} end of group TMR_REVB_INTFL_Register */

/**
 * @ingroup  tmr_revb_registers
 * @defgroup TMR_REVB_CTRL0 TMR_REVB_CTRL0
 * @brief    Timer Control Register.
 * @{
 */
 #define MXC_F_TMR_REVB_CTRL0_MODE_A_POS                0 /**< CTRL0_MODE_A Position */
 #define MXC_F_TMR_REVB_CTRL0_MODE_A                    ((uint32_t)(0xFUL << MXC_F_TMR_REVB_CTRL0_MODE_A_POS)) /**< CTRL0_MODE_A Mask */
 #define MXC_V_TMR_REVB_CTRL0_MODE_A_ONE_SHOT           ((uint32_t)0x0UL) /**< CTRL0_MODE_A_ONE_SHOT Value */
 #define MXC_S_TMR_REVB_CTRL0_MODE_A_ONE_SHOT           (MXC_V_TMR_REVB_CTRL0_MODE_A_ONE_SHOT << MXC_F_TMR_REVB_CTRL0_MODE_A_POS) /**< CTRL0_MODE_A_ONE_SHOT Setting */
 #define MXC_V_TMR_REVB_CTRL0_MODE_A_CONTINUOUS         ((uint32_t)0x1UL) /**< CTRL0_MODE_A_CONTINUOUS Value */
 #define MXC_S_TMR_REVB_CTRL0_MODE_A_CONTINUOUS         (MXC_V_TMR_REVB_CTRL0_MODE_A_CONTINUOUS << MXC_F_TMR_REVB_CTRL0_MODE_A_POS) /**< CTRL0_MODE_A_CONTINUOUS Setting */
 #define MXC_V_TMR_REVB_CTRL0_MODE_A_COUNTER            ((uint32_t)0x2UL) /**< CTRL0_MODE_A_COUNTER Value */
 #define MXC_S_TMR_REVB_CTRL0_MODE_A_COUNTER            (MXC_V_TMR_REVB_CTRL0_MODE_A_COUNTER << MXC_F_TMR_REVB_CTRL0_MODE_A_POS) /**< CTRL0_MODE_A_COUNTER Setting */
 #define MXC_V_TMR_REVB_CTRL0_MODE_A_PWM                ((uint32_t)0x3UL) /**< CTRL0_MODE_A_PWM Value */
 #define MXC_S_TMR_REVB_CTRL0_MODE_A_PWM                (MXC_V_TMR_REVB_CTRL0_MODE_A_PWM << MXC_F_TMR_REVB_CTRL0_MODE_A_POS) /**< CTRL0_MODE_A_PWM Setting */
 #define MXC_V_TMR_REVB_CTRL0_MODE_A_CAPTURE            ((uint32_t)0x4UL) /**< CTRL0_MODE_A_CAPTURE Value */
 #define MXC_S_TMR_REVB_CTRL0_MODE_A_CAPTURE            (MXC_V_TMR_REVB_CTRL0_MODE_A_CAPTURE << MXC_F_TMR_REVB_CTRL0_MODE_A_POS) /**< CTRL0_MODE_A_CAPTURE Setting */
 #define MXC_V_TMR_REVB_CTRL0_MODE_A_COMPARE            ((uint32_t)0x5UL) /**< CTRL0_MODE_A_COMPARE Value */
 #define MXC_S_TMR_REVB_CTRL0_MODE_A_COMPARE            (MXC_V_TMR_REVB_CTRL0_MODE_A_COMPARE << MXC_F_TMR_REVB_CTRL0_MODE_A_POS) /**< CTRL0_MODE_A_COMPARE Setting */
 #define MXC_V_TMR_REVB_CTRL0_MODE_A_GATED              ((uint32_t)0x6UL) /**< CTRL0_MODE_A_GATED Value */
 #define MXC_S_TMR_REVB_CTRL0_MODE_A_GATED              (MXC_V_TMR_REVB_CTRL0_MODE_A_GATED << MXC_F_TMR_REVB_CTRL0_MODE_A_POS) /**< CTRL0_MODE_A_GATED Setting */
 #define MXC_V_TMR_REVB_CTRL0_MODE_A_CAPCOMP            ((uint32_t)0x7UL) /**< CTRL0_MODE_A_CAPCOMP Value */
 #define MXC_S_TMR_REVB_CTRL0_MODE_A_CAPCOMP            (MXC_V_TMR_REVB_CTRL0_MODE_A_CAPCOMP << MXC_F_TMR_REVB_CTRL0_MODE_A_POS) /**< CTRL0_MODE_A_CAPCOMP Setting */
 #define MXC_V_TMR_REVB_CTRL0_MODE_A_DUAL_EDGE          ((uint32_t)0x8UL) /**< CTRL0_MODE_A_DUAL_EDGE Value */
 #define MXC_S_TMR_REVB_CTRL0_MODE_A_DUAL_EDGE          (MXC_V_TMR_REVB_CTRL0_MODE_A_DUAL_EDGE << MXC_F_TMR_REVB_CTRL0_MODE_A_POS) /**< CTRL0_MODE_A_DUAL_EDGE Setting */
 #define MXC_V_TMR_REVB_CTRL0_MODE_A_IGATED             ((uint32_t)0xCUL) /**< CTRL0_MODE_A_IGATED Value */
 #define MXC_S_TMR_REVB_CTRL0_MODE_A_IGATED             (MXC_V_TMR_REVB_CTRL0_MODE_A_IGATED << MXC_F_TMR_REVB_CTRL0_MODE_A_POS) /**< CTRL0_MODE_A_IGATED Setting */

 #define MXC_F_TMR_REVB_CTRL0_CLKDIV_A_POS              4 /**< CTRL0_CLKDIV_A Position */
 #define MXC_F_TMR_REVB_CTRL0_CLKDIV_A                  ((uint32_t)(0xFUL << MXC_F_TMR_REVB_CTRL0_CLKDIV_A_POS)) /**< CTRL0_CLKDIV_A Mask */
 #define MXC_V_TMR_REVB_CTRL0_CLKDIV_A_DIV_BY_1         ((uint32_t)0x0UL) /**< CTRL0_CLKDIV_A_DIV_BY_1 Value */
 #define MXC_S_TMR_REVB_CTRL0_CLKDIV_A_DIV_BY_1         (MXC_V_TMR_REVB_CTRL0_CLKDIV_A_DIV_BY_1 << MXC_F_TMR_REVB_CTRL0_CLKDIV_A_POS) /**< CTRL0_CLKDIV_A_DIV_BY_1 Setting */
 #define MXC_V_TMR_REVB_CTRL0_CLKDIV_A_DIV_BY_2         ((uint32_t)0x1UL) /**< CTRL0_CLKDIV_A_DIV_BY_2 Value */
 #define MXC_S_TMR_REVB_CTRL0_CLKDIV_A_DIV_BY_2         (MXC_V_TMR_REVB_CTRL0_CLKDIV_A_DIV_BY_2 << MXC_F_TMR_REVB_CTRL0_CLKDIV_A_POS) /**< CTRL0_CLKDIV_A_DIV_BY_2 Setting */
 #define MXC_V_TMR_REVB_CTRL0_CLKDIV_A_DIV_BY_4         ((uint32_t)0x2UL) /**< CTRL0_CLKDIV_A_DIV_BY_4 Value */
 #define MXC_S_TMR_REVB_CTRL0_CLKDIV_A_DIV_BY_4         (MXC_V_TMR_REVB_CTRL0_CLKDIV_A_DIV_BY_4 << MXC_F_TMR_REVB_CTRL0_CLKDIV_A_POS) /**< CTRL0_CLKDIV_A_DIV_BY_4 Setting */
 #define MXC_V_TMR_REVB_CTRL0_CLKDIV_A_DIV_BY_8         ((uint32_t)0x3UL) /**< CTRL0_CLKDIV_A_DIV_BY_8 Value */
 #define MXC_S_TMR_REVB_CTRL0_CLKDIV_A_DIV_BY_8         (MXC_V_TMR_REVB_CTRL0_CLKDIV_A_DIV_BY_8 << MXC_F_TMR_REVB_CTRL0_CLKDIV_A_POS) /**< CTRL0_CLKDIV_A_DIV_BY_8 Setting */
 #define MXC_V_TMR_REVB_CTRL0_CLKDIV_A_DIV_BY_16        ((uint32_t)0x4UL) /**< CTRL0_CLKDIV_A_DIV_BY_16 Value */
 #define MXC_S_TMR_REVB_CTRL0_CLKDIV_A_DIV_BY_16        (MXC_V_TMR_REVB_CTRL0_CLKDIV_A_DIV_BY_16 << MXC_F_TMR_REVB_CTRL0_CLKDIV_A_POS) /**< CTRL0_CLKDIV_A_DIV_BY_16 Setting */
 #define MXC_V_TMR_REVB_CTRL0_CLKDIV_A_DIV_BY_32        ((uint32_t)0x5UL) /**< CTRL0_CLKDIV_A_DIV_BY_32 Value */
 #define MXC_S_TMR_REVB_CTRL0_CLKDIV_A_DIV_BY_32        (MXC_V_TMR_REVB_CTRL0_CLKDIV_A_DIV_BY_32 << MXC_F_TMR_REVB_CTRL0_CLKDIV_A_POS) /**< CTRL0_CLKDIV_A_DIV_BY_32 Setting */
 #define MXC_V_TMR_REVB_CTRL0_CLKDIV_A_DIV_BY_64        ((uint32_t)0x6UL) /**< CTRL0_CLKDIV_A_DIV_BY_64 Value */
 #define MXC_S_TMR_REVB_CTRL0_CLKDIV_A_DIV_BY_64        (MXC_V_TMR_REVB_CTRL0_CLKDIV_A_DIV_BY_64 << MXC_F_TMR_REVB_CTRL0_CLKDIV_A_POS) /**< CTRL0_CLKDIV_A_DIV_BY_64 Setting */
 #define MXC_V_TMR_REVB_CTRL0_CLKDIV_A_DIV_BY_128       ((uint32_t)0x7UL) /**< CTRL0_CLKDIV_A_DIV_BY_128 Value */
 #define MXC_S_TMR_REVB_CTRL0_CLKDIV_A_DIV_BY_128       (MXC_V_TMR_REVB_CTRL0_CLKDIV_A_DIV_BY_128 << MXC_F_TMR_REVB_CTRL0_CLKDIV_A_POS) /**< CTRL0_CLKDIV_A_DIV_BY_128 Setting */
 #define MXC_V_TMR_REVB_CTRL0_CLKDIV_A_DIV_BY_256       ((uint32_t)0x8UL) /**< CTRL0_CLKDIV_A_DIV_BY_256 Value */
 #define MXC_S_TMR_REVB_CTRL0_CLKDIV_A_DIV_BY_256       (MXC_V_TMR_REVB_CTRL0_CLKDIV_A_DIV_BY_256 << MXC_F_TMR_REVB_CTRL0_CLKDIV_A_POS) /**< CTRL0_CLKDIV_A_DIV_BY_256 Setting */
 #define MXC_V_TMR_REVB_CTRL0_CLKDIV_A_DIV_BY_512       ((uint32_t)0x9UL) /**< CTRL0_CLKDIV_A_DIV_BY_512 Value */
 #define MXC_S_TMR_REVB_CTRL0_CLKDIV_A_DIV_BY_512       (MXC_V_TMR_REVB_CTRL0_CLKDIV_A_DIV_BY_512 << MXC_F_TMR_REVB_CTRL0_CLKDIV_A_POS) /**< CTRL0_CLKDIV_A_DIV_BY_512 Setting */
 #define MXC_V_TMR_REVB_CTRL0_CLKDIV_A_DIV_BY_1024      ((uint32_t)0xAUL) /**< CTRL0_CLKDIV_A_DIV_BY_1024 Value */
 #define MXC_S_TMR_REVB_CTRL0_CLKDIV_A_DIV_BY_1024      (MXC_V_TMR_REVB_CTRL0_CLKDIV_A_DIV_BY_1024 << MXC_F_TMR_REVB_CTRL0_CLKDIV_A_POS) /**< CTRL0_CLKDIV_A_DIV_BY_1024 Setting */
 #define MXC_V_TMR_REVB_CTRL0_CLKDIV_A_DIV_BY_2048      ((uint32_t)0xBUL) /**< CTRL0_CLKDIV_A_DIV_BY_2048 Value */
 #define MXC_S_TMR_REVB_CTRL0_CLKDIV_A_DIV_BY_2048      (MXC_V_TMR_REVB_CTRL0_CLKDIV_A_DIV_BY_2048 << MXC_F_TMR_REVB_CTRL0_CLKDIV_A_POS) /**< CTRL0_CLKDIV_A_DIV_BY_2048 Setting */
 #define MXC_V_TMR_REVB_CTRL0_CLKDIV_A_DIV_BY_4096      ((uint32_t)0xCUL) /**< CTRL0_CLKDIV_A_DIV_BY_4096 Value */
 #define MXC_S_TMR_REVB_CTRL0_CLKDIV_A_DIV_BY_4096      (MXC_V_TMR_REVB_CTRL0_CLKDIV_A_DIV_BY_4096 << MXC_F_TMR_REVB_CTRL0_CLKDIV_A_POS) /**< CTRL0_CLKDIV_A_DIV_BY_4096 Setting */

 #define MXC_F_TMR_REVB_CTRL0_POL_A_POS                 8 /**< CTRL0_POL_A Position */
 #define MXC_F_TMR_REVB_CTRL0_POL_A                     ((uint32_t)(0x1UL << MXC_F_TMR_REVB_CTRL0_POL_A_POS)) /**< CTRL0_POL_A Mask */

 #define MXC_F_TMR_REVB_CTRL0_PWMSYNC_A_POS             9 /**< CTRL0_PWMSYNC_A Position */
 #define MXC_F_TMR_REVB_CTRL0_PWMSYNC_A                 ((uint32_t)(0x1UL << MXC_F_TMR_REVB_CTRL0_PWMSYNC_A_POS)) /**< CTRL0_PWMSYNC_A Mask */

 #define MXC_F_TMR_REVB_CTRL0_NOLHPOL_A_POS             10 /**< CTRL0_NOLHPOL_A Position */
 #define MXC_F_TMR_REVB_CTRL0_NOLHPOL_A                 ((uint32_t)(0x1UL << MXC_F_TMR_REVB_CTRL0_NOLHPOL_A_POS)) /**< CTRL0_NOLHPOL_A Mask */

