ARMmbed/mbed-os/targets/TARGET_Maxim/TARGET_MAX32670/Libraries/PeriphDrivers/Source/TMR/tmr_revb_regs.h
 #define MXC_F_TMR_REVB_CTRL0_NOLLPOL_A_POS             11 /**< CTRL0_NOLLPOL_A Position */
 #define MXC_F_TMR_REVB_CTRL0_NOLLPOL_A                 ((uint32_t)(0x1UL << MXC_F_TMR_REVB_CTRL0_NOLLPOL_A_POS)) /**< CTRL0_NOLLPOL_A Mask */

 #define MXC_F_TMR_REVB_CTRL0_PWMCKBD_A_POS             12 /**< CTRL0_PWMCKBD_A Position */
 #define MXC_F_TMR_REVB_CTRL0_PWMCKBD_A                 ((uint32_t)(0x1UL << MXC_F_TMR_REVB_CTRL0_PWMCKBD_A_POS)) /**< CTRL0_PWMCKBD_A Mask */

 #define MXC_F_TMR_REVB_CTRL0_RST_A_POS                 13 /**< CTRL0_RST_A Position */
 #define MXC_F_TMR_REVB_CTRL0_RST_A                     ((uint32_t)(0x1UL << MXC_F_TMR_REVB_CTRL0_RST_A_POS)) /**< CTRL0_RST_A Mask */

 #define MXC_F_TMR_REVB_CTRL0_CLKEN_A_POS               14 /**< CTRL0_CLKEN_A Position */
 #define MXC_F_TMR_REVB_CTRL0_CLKEN_A                   ((uint32_t)(0x1UL << MXC_F_TMR_REVB_CTRL0_CLKEN_A_POS)) /**< CTRL0_CLKEN_A Mask */

 #define MXC_F_TMR_REVB_CTRL0_EN_A_POS                  15 /**< CTRL0_EN_A Position */
 #define MXC_F_TMR_REVB_CTRL0_EN_A                      ((uint32_t)(0x1UL << MXC_F_TMR_REVB_CTRL0_EN_A_POS)) /**< CTRL0_EN_A Mask */

 #define MXC_F_TMR_REVB_CTRL0_MODE_B_POS                16 /**< CTRL0_MODE_B Position */
 #define MXC_F_TMR_REVB_CTRL0_MODE_B                    ((uint32_t)(0xFUL << MXC_F_TMR_REVB_CTRL0_MODE_B_POS)) /**< CTRL0_MODE_B Mask */
 #define MXC_V_TMR_REVB_CTRL0_MODE_B_ONE_SHOT           ((uint32_t)0x0UL) /**< CTRL0_MODE_B_ONE_SHOT Value */
 #define MXC_S_TMR_REVB_CTRL0_MODE_B_ONE_SHOT           (MXC_V_TMR_REVB_CTRL0_MODE_B_ONE_SHOT << MXC_F_TMR_REVB_CTRL0_MODE_B_POS) /**< CTRL0_MODE_B_ONE_SHOT Setting */
 #define MXC_V_TMR_REVB_CTRL0_MODE_B_CONTINUOUS         ((uint32_t)0x1UL) /**< CTRL0_MODE_B_CONTINUOUS Value */
 #define MXC_S_TMR_REVB_CTRL0_MODE_B_CONTINUOUS         (MXC_V_TMR_REVB_CTRL0_MODE_B_CONTINUOUS << MXC_F_TMR_REVB_CTRL0_MODE_B_POS) /**< CTRL0_MODE_B_CONTINUOUS Setting */
 #define MXC_V_TMR_REVB_CTRL0_MODE_B_COUNTER            ((uint32_t)0x2UL) /**< CTRL0_MODE_B_COUNTER Value */
 #define MXC_S_TMR_REVB_CTRL0_MODE_B_COUNTER            (MXC_V_TMR_REVB_CTRL0_MODE_B_COUNTER << MXC_F_TMR_REVB_CTRL0_MODE_B_POS) /**< CTRL0_MODE_B_COUNTER Setting */
 #define MXC_V_TMR_REVB_CTRL0_MODE_B_PWM                ((uint32_t)0x3UL) /**< CTRL0_MODE_B_PWM Value */
 #define MXC_S_TMR_REVB_CTRL0_MODE_B_PWM                (MXC_V_TMR_REVB_CTRL0_MODE_B_PWM << MXC_F_TMR_REVB_CTRL0_MODE_B_POS) /**< CTRL0_MODE_B_PWM Setting */
 #define MXC_V_TMR_REVB_CTRL0_MODE_B_CAPTURE            ((uint32_t)0x4UL) /**< CTRL0_MODE_B_CAPTURE Value */
 #define MXC_S_TMR_REVB_CTRL0_MODE_B_CAPTURE            (MXC_V_TMR_REVB_CTRL0_MODE_B_CAPTURE << MXC_F_TMR_REVB_CTRL0_MODE_B_POS) /**< CTRL0_MODE_B_CAPTURE Setting */
 #define MXC_V_TMR_REVB_CTRL0_MODE_B_COMPARE            ((uint32_t)0x5UL) /**< CTRL0_MODE_B_COMPARE Value */
 #define MXC_S_TMR_REVB_CTRL0_MODE_B_COMPARE            (MXC_V_TMR_REVB_CTRL0_MODE_B_COMPARE << MXC_F_TMR_REVB_CTRL0_MODE_B_POS) /**< CTRL0_MODE_B_COMPARE Setting */
 #define MXC_V_TMR_REVB_CTRL0_MODE_B_GATED              ((uint32_t)0x6UL) /**< CTRL0_MODE_B_GATED Value */
 #define MXC_S_TMR_REVB_CTRL0_MODE_B_GATED              (MXC_V_TMR_REVB_CTRL0_MODE_B_GATED << MXC_F_TMR_REVB_CTRL0_MODE_B_POS) /**< CTRL0_MODE_B_GATED Setting */
 #define MXC_V_TMR_REVB_CTRL0_MODE_B_CAPCOMP            ((uint32_t)0x7UL) /**< CTRL0_MODE_B_CAPCOMP Value */
 #define MXC_S_TMR_REVB_CTRL0_MODE_B_CAPCOMP            (MXC_V_TMR_REVB_CTRL0_MODE_B_CAPCOMP << MXC_F_TMR_REVB_CTRL0_MODE_B_POS) /**< CTRL0_MODE_B_CAPCOMP Setting */
 #define MXC_V_TMR_REVB_CTRL0_MODE_B_DUAL_EDGE          ((uint32_t)0x8UL) /**< CTRL0_MODE_B_DUAL_EDGE Value */
 #define MXC_S_TMR_REVB_CTRL0_MODE_B_DUAL_EDGE          (MXC_V_TMR_REVB_CTRL0_MODE_B_DUAL_EDGE << MXC_F_TMR_REVB_CTRL0_MODE_B_POS) /**< CTRL0_MODE_B_DUAL_EDGE Setting */
 #define MXC_V_TMR_REVB_CTRL0_MODE_B_IGATED             ((uint32_t)0xEUL) /**< CTRL0_MODE_B_IGATED Value */
 #define MXC_S_TMR_REVB_CTRL0_MODE_B_IGATED             (MXC_V_TMR_REVB_CTRL0_MODE_B_IGATED << MXC_F_TMR_REVB_CTRL0_MODE_B_POS) /**< CTRL0_MODE_B_IGATED Setting */

 #define MXC_F_TMR_REVB_CTRL0_CLKDIV_B_POS              20 /**< CTRL0_CLKDIV_B Position */
 #define MXC_F_TMR_REVB_CTRL0_CLKDIV_B                  ((uint32_t)(0xFUL << MXC_F_TMR_REVB_CTRL0_CLKDIV_B_POS)) /**< CTRL0_CLKDIV_B Mask */
 #define MXC_V_TMR_REVB_CTRL0_CLKDIV_B_DIV_BY_1         ((uint32_t)0x0UL) /**< CTRL0_CLKDIV_B_DIV_BY_1 Value */
 #define MXC_S_TMR_REVB_CTRL0_CLKDIV_B_DIV_BY_1         (MXC_V_TMR_REVB_CTRL0_CLKDIV_B_DIV_BY_1 << MXC_F_TMR_REVB_CTRL0_CLKDIV_B_POS) /**< CTRL0_CLKDIV_B_DIV_BY_1 Setting */
 #define MXC_V_TMR_REVB_CTRL0_CLKDIV_B_DIV_BY_2         ((uint32_t)0x1UL) /**< CTRL0_CLKDIV_B_DIV_BY_2 Value */
 #define MXC_S_TMR_REVB_CTRL0_CLKDIV_B_DIV_BY_2         (MXC_V_TMR_REVB_CTRL0_CLKDIV_B_DIV_BY_2 << MXC_F_TMR_REVB_CTRL0_CLKDIV_B_POS) /**< CTRL0_CLKDIV_B_DIV_BY_2 Setting */
 #define MXC_V_TMR_REVB_CTRL0_CLKDIV_B_DIV_BY_4         ((uint32_t)0x2UL) /**< CTRL0_CLKDIV_B_DIV_BY_4 Value */
 #define MXC_S_TMR_REVB_CTRL0_CLKDIV_B_DIV_BY_4         (MXC_V_TMR_REVB_CTRL0_CLKDIV_B_DIV_BY_4 << MXC_F_TMR_REVB_CTRL0_CLKDIV_B_POS) /**< CTRL0_CLKDIV_B_DIV_BY_4 Setting */
 #define MXC_V_TMR_REVB_CTRL0_CLKDIV_B_DIV_BY_8         ((uint32_t)0x3UL) /**< CTRL0_CLKDIV_B_DIV_BY_8 Value */
 #define MXC_S_TMR_REVB_CTRL0_CLKDIV_B_DIV_BY_8         (MXC_V_TMR_REVB_CTRL0_CLKDIV_B_DIV_BY_8 << MXC_F_TMR_REVB_CTRL0_CLKDIV_B_POS) /**< CTRL0_CLKDIV_B_DIV_BY_8 Setting */
 #define MXC_V_TMR_REVB_CTRL0_CLKDIV_B_DIV_BY_16        ((uint32_t)0x4UL) /**< CTRL0_CLKDIV_B_DIV_BY_16 Value */
 #define MXC_S_TMR_REVB_CTRL0_CLKDIV_B_DIV_BY_16        (MXC_V_TMR_REVB_CTRL0_CLKDIV_B_DIV_BY_16 << MXC_F_TMR_REVB_CTRL0_CLKDIV_B_POS) /**< CTRL0_CLKDIV_B_DIV_BY_16 Setting */
 #define MXC_V_TMR_REVB_CTRL0_CLKDIV_B_DIV_BY_32        ((uint32_t)0x5UL) /**< CTRL0_CLKDIV_B_DIV_BY_32 Value */
 #define MXC_S_TMR_REVB_CTRL0_CLKDIV_B_DIV_BY_32        (MXC_V_TMR_REVB_CTRL0_CLKDIV_B_DIV_BY_32 << MXC_F_TMR_REVB_CTRL0_CLKDIV_B_POS) /**< CTRL0_CLKDIV_B_DIV_BY_32 Setting */
 #define MXC_V_TMR_REVB_CTRL0_CLKDIV_B_DIV_BY_64        ((uint32_t)0x6UL) /**< CTRL0_CLKDIV_B_DIV_BY_64 Value */
 #define MXC_S_TMR_REVB_CTRL0_CLKDIV_B_DIV_BY_64        (MXC_V_TMR_REVB_CTRL0_CLKDIV_B_DIV_BY_64 << MXC_F_TMR_REVB_CTRL0_CLKDIV_B_POS) /**< CTRL0_CLKDIV_B_DIV_BY_64 Setting */
 #define MXC_V_TMR_REVB_CTRL0_CLKDIV_B_DIV_BY_128       ((uint32_t)0x7UL) /**< CTRL0_CLKDIV_B_DIV_BY_128 Value */
 #define MXC_S_TMR_REVB_CTRL0_CLKDIV_B_DIV_BY_128       (MXC_V_TMR_REVB_CTRL0_CLKDIV_B_DIV_BY_128 << MXC_F_TMR_REVB_CTRL0_CLKDIV_B_POS) /**< CTRL0_CLKDIV_B_DIV_BY_128 Setting */
 #define MXC_V_TMR_REVB_CTRL0_CLKDIV_B_DIV_BY_256       ((uint32_t)0x8UL) /**< CTRL0_CLKDIV_B_DIV_BY_256 Value */
 #define MXC_S_TMR_REVB_CTRL0_CLKDIV_B_DIV_BY_256       (MXC_V_TMR_REVB_CTRL0_CLKDIV_B_DIV_BY_256 << MXC_F_TMR_REVB_CTRL0_CLKDIV_B_POS) /**< CTRL0_CLKDIV_B_DIV_BY_256 Setting */
 #define MXC_V_TMR_REVB_CTRL0_CLKDIV_B_DIV_BY_512       ((uint32_t)0x9UL) /**< CTRL0_CLKDIV_B_DIV_BY_512 Value */
 #define MXC_S_TMR_REVB_CTRL0_CLKDIV_B_DIV_BY_512       (MXC_V_TMR_REVB_CTRL0_CLKDIV_B_DIV_BY_512 << MXC_F_TMR_REVB_CTRL0_CLKDIV_B_POS) /**< CTRL0_CLKDIV_B_DIV_BY_512 Setting */
 #define MXC_V_TMR_REVB_CTRL0_CLKDIV_B_DIV_BY_1024      ((uint32_t)0xAUL) /**< CTRL0_CLKDIV_B_DIV_BY_1024 Value */
 #define MXC_S_TMR_REVB_CTRL0_CLKDIV_B_DIV_BY_1024      (MXC_V_TMR_REVB_CTRL0_CLKDIV_B_DIV_BY_1024 << MXC_F_TMR_REVB_CTRL0_CLKDIV_B_POS) /**< CTRL0_CLKDIV_B_DIV_BY_1024 Setting */
 #define MXC_V_TMR_REVB_CTRL0_CLKDIV_B_DIV_BY_2048      ((uint32_t)0xBUL) /**< CTRL0_CLKDIV_B_DIV_BY_2048 Value */
 #define MXC_S_TMR_REVB_CTRL0_CLKDIV_B_DIV_BY_2048      (MXC_V_TMR_REVB_CTRL0_CLKDIV_B_DIV_BY_2048 << MXC_F_TMR_REVB_CTRL0_CLKDIV_B_POS) /**< CTRL0_CLKDIV_B_DIV_BY_2048 Setting */
 #define MXC_V_TMR_REVB_CTRL0_CLKDIV_B_DIV_BY_4096      ((uint32_t)0xCUL) /**< CTRL0_CLKDIV_B_DIV_BY_4096 Value */
 #define MXC_S_TMR_REVB_CTRL0_CLKDIV_B_DIV_BY_4096      (MXC_V_TMR_REVB_CTRL0_CLKDIV_B_DIV_BY_4096 << MXC_F_TMR_REVB_CTRL0_CLKDIV_B_POS) /**< CTRL0_CLKDIV_B_DIV_BY_4096 Setting */

 #define MXC_F_TMR_REVB_CTRL0_POL_B_POS                 24 /**< CTRL0_POL_B Position */
 #define MXC_F_TMR_REVB_CTRL0_POL_B                     ((uint32_t)(0x1UL << MXC_F_TMR_REVB_CTRL0_POL_B_POS)) /**< CTRL0_POL_B Mask */

 #define MXC_F_TMR_REVB_CTRL0_PWMSYNC_B_POS             25 /**< CTRL0_PWMSYNC_B Position */
 #define MXC_F_TMR_REVB_CTRL0_PWMSYNC_B                 ((uint32_t)(0x1UL << MXC_F_TMR_REVB_CTRL0_PWMSYNC_B_POS)) /**< CTRL0_PWMSYNC_B Mask */

 #define MXC_F_TMR_REVB_CTRL0_NOLHPOL_B_POS             26 /**< CTRL0_NOLHPOL_B Position */
 #define MXC_F_TMR_REVB_CTRL0_NOLHPOL_B                 ((uint32_t)(0x1UL << MXC_F_TMR_REVB_CTRL0_NOLHPOL_B_POS)) /**< CTRL0_NOLHPOL_B Mask */

