ARMmbed/mbed-os/targets/TARGET_Maxim/TARGET_MAX32670/Libraries/PeriphDrivers/Source/TMR/tmr_revb_regs.h
 #define MXC_F_TMR_REVB_CTRL0_NOLLPOL_B_POS             27 /**< CTRL0_NOLLPOL_B Position */
 #define MXC_F_TMR_REVB_CTRL0_NOLLPOL_B                 ((uint32_t)(0x1UL << MXC_F_TMR_REVB_CTRL0_NOLLPOL_B_POS)) /**< CTRL0_NOLLPOL_B Mask */

 #define MXC_F_TMR_REVB_CTRL0_PWMCKBD_B_POS             28 /**< CTRL0_PWMCKBD_B Position */
 #define MXC_F_TMR_REVB_CTRL0_PWMCKBD_B                 ((uint32_t)(0x1UL << MXC_F_TMR_REVB_CTRL0_PWMCKBD_B_POS)) /**< CTRL0_PWMCKBD_B Mask */

 #define MXC_F_TMR_REVB_CTRL0_RST_B_POS                 29 /**< CTRL0_RST_B Position */
 #define MXC_F_TMR_REVB_CTRL0_RST_B                     ((uint32_t)(0x1UL << MXC_F_TMR_REVB_CTRL0_RST_B_POS)) /**< CTRL0_RST_B Mask */

 #define MXC_F_TMR_REVB_CTRL0_CLKEN_B_POS               30 /**< CTRL0_CLKEN_B Position */
 #define MXC_F_TMR_REVB_CTRL0_CLKEN_B                   ((uint32_t)(0x1UL << MXC_F_TMR_REVB_CTRL0_CLKEN_B_POS)) /**< CTRL0_CLKEN_B Mask */

 #define MXC_F_TMR_REVB_CTRL0_EN_B_POS                  31 /**< CTRL0_EN_B Position */
 #define MXC_F_TMR_REVB_CTRL0_EN_B                      ((uint32_t)(0x1UL << MXC_F_TMR_REVB_CTRL0_EN_B_POS)) /**< CTRL0_EN_B Mask */

/**@} end of group TMR_REVB_CTRL0_Register */

/**
 * @ingroup  tmr_revb_registers
 * @defgroup TMR_REVB_NOLCMP TMR_REVB_NOLCMP
 * @brief    Timer Non-Overlapping Compare Register.
 * @{
 */
 #define MXC_F_TMR_REVB_NOLCMP_LO_A_POS                 0 /**< NOLCMP_LO_A Position */
 #define MXC_F_TMR_REVB_NOLCMP_LO_A                     ((uint32_t)(0xFFUL << MXC_F_TMR_REVB_NOLCMP_LO_A_POS)) /**< NOLCMP_LO_A Mask */

 #define MXC_F_TMR_REVB_NOLCMP_HI_A_POS                 8 /**< NOLCMP_HI_A Position */
 #define MXC_F_TMR_REVB_NOLCMP_HI_A                     ((uint32_t)(0xFFUL << MXC_F_TMR_REVB_NOLCMP_HI_A_POS)) /**< NOLCMP_HI_A Mask */

 #define MXC_F_TMR_REVB_NOLCMP_LO_B_POS                 16 /**< NOLCMP_LO_B Position */
 #define MXC_F_TMR_REVB_NOLCMP_LO_B                     ((uint32_t)(0xFFUL << MXC_F_TMR_REVB_NOLCMP_LO_B_POS)) /**< NOLCMP_LO_B Mask */

 #define MXC_F_TMR_REVB_NOLCMP_HI_B_POS                 24 /**< NOLCMP_HI_B Position */
 #define MXC_F_TMR_REVB_NOLCMP_HI_B                     ((uint32_t)(0xFFUL << MXC_F_TMR_REVB_NOLCMP_HI_B_POS)) /**< NOLCMP_HI_B Mask */

/**@} end of group TMR_REVB_NOLCMP_Register */

/**
 * @ingroup  tmr_revb_registers
 * @defgroup TMR_REVB_CTRL1 TMR_REVB_CTRL1
 * @brief    Timer Configuration Register.
 * @{
 */
 #define MXC_F_TMR_REVB_CTRL1_CLKSEL_A_POS              0 /**< CTRL1_CLKSEL_A Position */
 #define MXC_F_TMR_REVB_CTRL1_CLKSEL_A                  ((uint32_t)(0x3UL << MXC_F_TMR_REVB_CTRL1_CLKSEL_A_POS)) /**< CTRL1_CLKSEL_A Mask */

 #define MXC_F_TMR_REVB_CTRL1_CLKEN_A_POS               2 /**< CTRL1_CLKEN_A Position */
 #define MXC_F_TMR_REVB_CTRL1_CLKEN_A                   ((uint32_t)(0x1UL << MXC_F_TMR_REVB_CTRL1_CLKEN_A_POS)) /**< CTRL1_CLKEN_A Mask */

 #define MXC_F_TMR_REVB_CTRL1_CLKRDY_A_POS              3 /**< CTRL1_CLKRDY_A Position */
 #define MXC_F_TMR_REVB_CTRL1_CLKRDY_A                  ((uint32_t)(0x1UL << MXC_F_TMR_REVB_CTRL1_CLKRDY_A_POS)) /**< CTRL1_CLKRDY_A Mask */

 #define MXC_F_TMR_REVB_CTRL1_EVENT_SEL_A_POS           4 /**< CTRL1_EVENT_SEL_A Position */
 #define MXC_F_TMR_REVB_CTRL1_EVENT_SEL_A               ((uint32_t)(0x7UL << MXC_F_TMR_REVB_CTRL1_EVENT_SEL_A_POS)) /**< CTRL1_EVENT_SEL_A Mask */

 #define MXC_F_TMR_REVB_CTRL1_NEGTRIG_A_POS             7 /**< CTRL1_NEGTRIG_A Position */
 #define MXC_F_TMR_REVB_CTRL1_NEGTRIG_A                 ((uint32_t)(0x1UL << MXC_F_TMR_REVB_CTRL1_NEGTRIG_A_POS)) /**< CTRL1_NEGTRIG_A Mask */

 #define MXC_F_TMR_REVB_CTRL1_IE_A_POS                  8 /**< CTRL1_IE_A Position */
 #define MXC_F_TMR_REVB_CTRL1_IE_A                      ((uint32_t)(0x1UL << MXC_F_TMR_REVB_CTRL1_IE_A_POS)) /**< CTRL1_IE_A Mask */

 #define MXC_F_TMR_REVB_CTRL1_CAPEVENT_SEL_A_POS        9 /**< CTRL1_CAPEVENT_SEL_A Position */
 #define MXC_F_TMR_REVB_CTRL1_CAPEVENT_SEL_A            ((uint32_t)(0x3UL << MXC_F_TMR_REVB_CTRL1_CAPEVENT_SEL_A_POS)) /**< CTRL1_CAPEVENT_SEL_A Mask */

 #define MXC_F_TMR_REVB_CTRL1_SW_CAPEVENT_A_POS         11 /**< CTRL1_SW_CAPEVENT_A Position */
 #define MXC_F_TMR_REVB_CTRL1_SW_CAPEVENT_A             ((uint32_t)(0x1UL << MXC_F_TMR_REVB_CTRL1_SW_CAPEVENT_A_POS)) /**< CTRL1_SW_CAPEVENT_A Mask */

 #define MXC_F_TMR_REVB_CTRL1_WE_A_POS                  12 /**< CTRL1_WE_A Position */
 #define MXC_F_TMR_REVB_CTRL1_WE_A                      ((uint32_t)(0x1UL << MXC_F_TMR_REVB_CTRL1_WE_A_POS)) /**< CTRL1_WE_A Mask */

 #define MXC_F_TMR_REVB_CTRL1_OUTEN_A_POS               13 /**< CTRL1_OUTEN_A Position */
 #define MXC_F_TMR_REVB_CTRL1_OUTEN_A                   ((uint32_t)(0x1UL << MXC_F_TMR_REVB_CTRL1_OUTEN_A_POS)) /**< CTRL1_OUTEN_A Mask */

 #define MXC_F_TMR_REVB_CTRL1_OUTBEN_A_POS              14 /**< CTRL1_OUTBEN_A Position */
 #define MXC_F_TMR_REVB_CTRL1_OUTBEN_A                  ((uint32_t)(0x1UL << MXC_F_TMR_REVB_CTRL1_OUTBEN_A_POS)) /**< CTRL1_OUTBEN_A Mask */

 #define MXC_F_TMR_REVB_CTRL1_CLKSEL_B_POS              16 /**< CTRL1_CLKSEL_B Position */
 #define MXC_F_TMR_REVB_CTRL1_CLKSEL_B                  ((uint32_t)(0x3UL << MXC_F_TMR_REVB_CTRL1_CLKSEL_B_POS)) /**< CTRL1_CLKSEL_B Mask */

 #define MXC_F_TMR_REVB_CTRL1_CLKEN_B_POS               18 /**< CTRL1_CLKEN_B Position */
 #define MXC_F_TMR_REVB_CTRL1_CLKEN_B                   ((uint32_t)(0x1UL << MXC_F_TMR_REVB_CTRL1_CLKEN_B_POS)) /**< CTRL1_CLKEN_B Mask */

 #define MXC_F_TMR_REVB_CTRL1_CLKRDY_B_POS              19 /**< CTRL1_CLKRDY_B Position */
 #define MXC_F_TMR_REVB_CTRL1_CLKRDY_B                  ((uint32_t)(0x1UL << MXC_F_TMR_REVB_CTRL1_CLKRDY_B_POS)) /**< CTRL1_CLKRDY_B Mask */

 #define MXC_F_TMR_REVB_CTRL1_EVENT_SEL_B_POS           20 /**< CTRL1_EVENT_SEL_B Position */
 #define MXC_F_TMR_REVB_CTRL1_EVENT_SEL_B               ((uint32_t)(0x7UL << MXC_F_TMR_REVB_CTRL1_EVENT_SEL_B_POS)) /**< CTRL1_EVENT_SEL_B Mask */

 #define MXC_F_TMR_REVB_CTRL1_NEGTRIG_B_POS             23 /**< CTRL1_NEGTRIG_B Position */
 #define MXC_F_TMR_REVB_CTRL1_NEGTRIG_B                 ((uint32_t)(0x1UL << MXC_F_TMR_REVB_CTRL1_NEGTRIG_B_POS)) /**< CTRL1_NEGTRIG_B Mask */

 #define MXC_F_TMR_REVB_CTRL1_IE_B_POS                  24 /**< CTRL1_IE_B Position */
 #define MXC_F_TMR_REVB_CTRL1_IE_B                      ((uint32_t)(0x1UL << MXC_F_TMR_REVB_CTRL1_IE_B_POS)) /**< CTRL1_IE_B Mask */

 #define MXC_F_TMR_REVB_CTRL1_CAPEVENT_SEL_B_POS        25 /**< CTRL1_CAPEVENT_SEL_B Position */
 #define MXC_F_TMR_REVB_CTRL1_CAPEVENT_SEL_B            ((uint32_t)(0x3UL << MXC_F_TMR_REVB_CTRL1_CAPEVENT_SEL_B_POS)) /**< CTRL1_CAPEVENT_SEL_B Mask */

 #define MXC_F_TMR_REVB_CTRL1_SW_CAPEVENT_B_POS         27 /**< CTRL1_SW_CAPEVENT_B Position */
 #define MXC_F_TMR_REVB_CTRL1_SW_CAPEVENT_B             ((uint32_t)(0x1UL << MXC_F_TMR_REVB_CTRL1_SW_CAPEVENT_B_POS)) /**< CTRL1_SW_CAPEVENT_B Mask */

 #define MXC_F_TMR_REVB_CTRL1_WE_B_POS                  28 /**< CTRL1_WE_B Position */
 #define MXC_F_TMR_REVB_CTRL1_WE_B                      ((uint32_t)(0x1UL << MXC_F_TMR_REVB_CTRL1_WE_B_POS)) /**< CTRL1_WE_B Mask */

 #define MXC_F_TMR_REVB_CTRL1_CASCADE_POS               31 /**< CTRL1_CASCADE Position */
 #define MXC_F_TMR_REVB_CTRL1_CASCADE                   ((uint32_t)(0x1UL << MXC_F_TMR_REVB_CTRL1_CASCADE_POS)) /**< CTRL1_CASCADE Mask */

/**@} end of group TMR_REVB_CTRL1_Register */

/**
 * @ingroup  tmr_revb_registers
 * @defgroup TMR_REVB_WKFL TMR_REVB_WKFL
 * @brief    Timer Wakeup Status Register.
 * @{
 */
 #define MXC_F_TMR_REVB_WKFL_A_POS                      0 /**< WKFL_A Position */
 #define MXC_F_TMR_REVB_WKFL_A                          ((uint32_t)(0x1UL << MXC_F_TMR_REVB_WKFL_A_POS)) /**< WKFL_A Mask */

 #define MXC_F_TMR_REVB_WKFL_B_POS                      16 /**< WKFL_B Position */
 #define MXC_F_TMR_REVB_WKFL_B                          ((uint32_t)(0x1UL << MXC_F_TMR_REVB_WKFL_B_POS)) /**< WKFL_B Mask */

/**@} end of group TMR_REVB_WKFL_Register */

#ifdef __cplusplus
}
#endif

#endif /* _TMR_REVB_REGS_H_ */
